---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.Insert(Autodesk.Revit.DB.SlabShapeVertex,System.Int32)
source: html/2f46508b-4646-b32e-e391-0f1cbf733243.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.Insert Method

Insert the specified item into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	SlabShapeVertex item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SlabShapeVertex`) - The item to be inserted into the array.
- **index** (`System.Int32`) - The item will be inserted before this index.

## Returns
Returns whether the item was inserted into the array.